In [105]:
import numpy as np
import pandas as pd

In [106]:
L = [1,2,3,4]
s = pd.Series(L)
s

0    1
1    2
2    3
3    4
dtype: int64

In [107]:
L = [1,2,3,4]
s = pd.Series(L, index = ['a','b','c','d'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [108]:
s['c']

3

In [109]:
s['c'] = 10

In [110]:
s

a     1
b     2
c    10
d     4
dtype: int64

In [111]:
s[['c','d']]

c    10
d     4
dtype: int64

In [112]:
s > 5

a    False
b    False
c     True
d    False
dtype: bool

In [113]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [114]:
'c' in s

True

In [115]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [116]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [117]:
s.index = ['가','나','다','라']

In [118]:
s['가'] = 5

In [119]:
s

가     5
나     2
다    10
라     4
dtype: int64

In [120]:
raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'may'],
           'last_name' : ['miller', np.nan, 'ali', 'milner', 'coozer'],
           'age': [42, np.nan, 36, 24, 73],
           'postestscore': [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'may'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'postestscore': [25, nan, nan, 62, 72]}

In [121]:
df = pd.DataFrame(raw_data, index = ['a','b','c','d','e'])
df

  first_name last_name   age  postestscore
a      jason    miller  42.0          25.0
b        NaN       NaN   NaN           NaN
c       tina       ali  36.0           NaN
d       jake    milner  24.0          62.0
e        may    coozer  73.0          72.0

In [122]:
df['first_name']

a    jason
b      NaN
c     tina
d     jake
e      may
Name: first_name, dtype: object

In [123]:
df[['last_name', 'age', 'postestscore']]

  last_name   age  postestscore
a    miller  42.0          25.0
b       NaN   NaN           NaN
c       ali  36.0           NaN
d    milner  24.0          62.0
e    coozer  73.0          72.0

In [124]:
df.age

a    42.0
b     NaN
c    36.0
d    24.0
e    73.0
Name: age, dtype: float64

In [125]:
df['age'] = df['age'].apply(lambda x : x * 2)

In [126]:
df['age']

a     84.0
b      NaN
c     72.0
d     48.0
e    146.0
Name: age, dtype: float64

In [127]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [128]:
df.columns

Index(['first_name', 'last_name', 'age', 'postestscore'], dtype='object')

In [129]:
df.values

array([['jason', 'miller', 84.0, 25.0],
       [nan, nan, nan, nan],
       ['tina', 'ali', 72.0, nan],
       ['jake', 'milner', 48.0, 62.0],
       ['may', 'coozer', 146.0, 72.0]], dtype=object)

In [130]:
df.loc['a']

first_name       jason
last_name       miller
age               84.0
postestscore      25.0
Name: a, dtype: object

In [131]:
df.loc['e']

first_name         may
last_name       coozer
age              146.0
postestscore      72.0
Name: e, dtype: object

In [132]:
df.loc[:'b']

  first_name last_name   age  postestscore
a      jason    miller  84.0          25.0
b        NaN       NaN   NaN           NaN

In [133]:
df.iloc[3]

first_name        jake
last_name       milner
age               48.0
postestscore      62.0
Name: d, dtype: object

In [134]:
df.iloc[:4]

  first_name last_name   age  postestscore
a      jason    miller  84.0          25.0
b        NaN       NaN   NaN           NaN
c       tina       ali  72.0           NaN
d       jake    milner  48.0          62.0

In [135]:
df.iloc[3:]

  first_name last_name    age  postestscore
d       jake    milner   48.0          62.0
e        may    coozer  146.0          72.0

In [136]:
df.loc[['a','c']]

  first_name last_name   age  postestscore
a      jason    miller  84.0          25.0
c       tina       ali  72.0           NaN

In [137]:
df.loc['a', ['first_name', 'age']]

first_name    jason
age            84.0
Name: a, dtype: object

In [138]:
df.loc[['c','d'], 'last_name':'postestscore']

  last_name   age  postestscore
c       ali  72.0           NaN
d    milner  48.0          62.0

In [139]:
df.loc['c']

first_name      tina
last_name        ali
age             72.0
postestscore     NaN
Name: c, dtype: object

In [140]:
df.loc['c', 'last_name'] = 'alio'

In [141]:
df.iloc[[2,4],2:4]

     age  postestscore
c   72.0           NaN
e  146.0          72.0

In [142]:
df.iloc[1:5:2]

  first_name last_name   age  postestscore
b        NaN       NaN   NaN           NaN
d       jake    milner  48.0          62.0

In [143]:
df.loc[df['age'] >= 40]

  first_name last_name    age  postestscore
a      jason    miller   84.0          25.0
c       tina      alio   72.0           NaN
d       jake    milner   48.0          62.0
e        may    coozer  146.0          72.0

In [144]:
df.loc[df['last_name'] == 'coozer']

  first_name last_name    age  postestscore
e        may    coozer  146.0          72.0

In [145]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
df.loc[df['age'] >= 40]['postestscore'].mean()

53.0

In [146]:
df['address'] = ['seoul', 'incheon', 'daejeon', 'pusan', 'gwangju']
df

  first_name last_name    age  postestscore  address
a      jason    miller   84.0          25.0    seoul
b        NaN       NaN    NaN           NaN  incheon
c       tina      alio   72.0           NaN  daejeon
d       jake    milner   48.0          62.0    pusan
e        may    coozer  146.0          72.0  gwangju

In [147]:
df.columns = ['fn', 'ln', 'age', 'posts', 'add']
df

      fn      ln    age  posts      add
a  jason  miller   84.0   25.0    seoul
b    NaN     NaN    NaN    NaN  incheon
c   tina    alio   72.0    NaN  daejeon
d   jake  milner   48.0   62.0    pusan
e    may  coozer  146.0   72.0  gwangju

In [148]:
df.rename(columns = {'ln' : 'last_name'}, inplace = True)

In [149]:
df

      fn last_name    age  posts      add
a  jason    miller   84.0   25.0    seoul
b    NaN       NaN    NaN    NaN  incheon
c   tina      alio   72.0    NaN  daejeon
d   jake    milner   48.0   62.0    pusan
e    may    coozer  146.0   72.0  gwangju

In [150]:
df.drop('add', axis = 1)

      fn last_name    age  posts
a  jason    miller   84.0   25.0
b    NaN       NaN    NaN    NaN
c   tina      alio   72.0    NaN
d   jake    milner   48.0   62.0
e    may    coozer  146.0   72.0

In [151]:
df.drop('c')

      fn last_name    age  posts      add
a  jason    miller   84.0   25.0    seoul
b    NaN       NaN    NaN    NaN  incheon
d   jake    milner   48.0   62.0    pusan
e    may    coozer  146.0   72.0  gwangju

In [152]:
df.tail(2)

     fn last_name    age  posts      add
d  jake    milner   48.0   62.0    pusan
e   may    coozer  146.0   72.0  gwangju

In [153]:
np.random.randn(5,5)

array([[ 0.42785766, -1.3941327 ,  0.60608992, -0.0763608 , -0.6561608 ],
       [-1.62821227, -0.97021186,  0.06879869,  1.30322307, -1.72294289],
       [ 0.27349195,  0.32542296, -0.04568901,  1.62590641,  0.51679899],
       [ 0.10329556, -0.30501653, -0.25217603, -0.40307321,  1.16619159],
       [-0.56837308, -0.47313195, -1.03343918,  1.44104021, -1.68424112]])

In [154]:
df = pd.DataFrame(np.random.randn(5,5))
df

          0         1         2         3         4
0 -0.669771  0.567277  0.732550 -0.180266 -1.078608
1  0.645697  1.370668 -0.972607 -2.317665 -0.250522
2 -1.265831  0.142113 -0.755603 -0.388307 -0.701810
3 -0.051111  1.513744  2.166482  0.268506 -2.637101
4  0.368017 -2.493003  0.834293 -0.400473  1.604106

In [155]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [156]:
df.columns = ['one', 'two', 'three', 'four', 'five']

In [157]:
df

        one       two     three      four      five
a -0.669771  0.567277  0.732550 -0.180266 -1.078608
b  0.645697  1.370668 -0.972607 -2.317665 -0.250522
c -1.265831  0.142113 -0.755603 -0.388307 -0.701810
d -0.051111  1.513744  2.166482  0.268506 -2.637101
e  0.368017 -2.493003  0.834293 -0.400473  1.604106

In [158]:
df.iloc[3:, 2] = np.nan
df.iloc[2, 2:4] = np.nan
df

        one       two     three      four      five
a -0.669771  0.567277  0.732550 -0.180266 -1.078608
b  0.645697  1.370668 -0.972607 -2.317665 -0.250522
c -1.265831  0.142113       NaN       NaN -0.701810
d -0.051111  1.513744       NaN  0.268506 -2.637101
e  0.368017 -2.493003       NaN -0.400473  1.604106

In [159]:
df.isnull().sum()

one      0
two      0
three    3
four     1
five     0
dtype: int64

In [160]:
df.dropna()

        one       two     three      four      five
a -0.669771  0.567277  0.732550 -0.180266 -1.078608
b  0.645697  1.370668 -0.972607 -2.317665 -0.250522

In [161]:
df.dropna(axis = 1)

        one       two      five
a -0.669771  0.567277 -1.078608
b  0.645697  1.370668 -0.250522
c -1.265831  0.142113 -0.701810
d -0.051111  1.513744 -2.637101
e  0.368017 -2.493003  1.604106

In [162]:
df.fillna('가')

        one       two     three      four      five
a -0.669771  0.567277   0.73255 -0.180266 -1.078608
b  0.645697  1.370668 -0.972607 -2.317665 -0.250522
c -1.265831  0.142113         가         가 -0.701810
d -0.051111  1.513744         가  0.268506 -2.637101
e  0.368017 -2.493003         가 -0.400473  1.604106

In [163]:
df.fillna(df.mean())

        one       two     three      four      five
a -0.669771  0.567277  0.732550 -0.180266 -1.078608
b  0.645697  1.370668 -0.972607 -2.317665 -0.250522
c -1.265831  0.142113 -0.120028 -0.657474 -0.701810
d -0.051111  1.513744 -0.120028  0.268506 -2.637101
e  0.368017 -2.493003 -0.120028 -0.400473  1.604106

In [164]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Giant', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Giant     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [165]:
df.groupby('Team')['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
Name: Points, dtype: float64

In [166]:
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [167]:
# 연도별 최고 점수는
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

In [168]:
# 팀별 데이터 수는?
df.groupby('Team').size()

Team
Devils    2
Giant     1
Kings     3
Riders    4
Royals    2
dtype: int64

In [169]:
# 팀별, 연도별 포인트 평균은?
df.groupby(['Team', 'Year'])['Points'].mean()

Team    Year
Devils  2014    863.0
        2015    673.0
Giant   2015    812.0
Kings   2014    741.0
        2016    756.0
        2017    788.0
Riders  2014    876.0
        2015    789.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
Name: Points, dtype: float64

In [170]:
grouped = df.groupby('Team')

In [171]:
grouped.agg(min)

        Rank  Year  Points
Team
Devils     2  2014     673
Giant      4  2015     812
Kings      1  2014     741
Riders     1  2014     690
Royals     1  2014     701

In [172]:
grouped.agg(np.mean)

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Giant   4.000000  2015.000000  812.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000

In [173]:
grouped.agg([np.min, np.max, np.mean])

       Rank                 Year                    Points
       amin amax      mean  amin  amax         mean   amin amax        mean
Team
Devils    2    3  2.500000  2014  2015  2014.500000    673  863  768.000000
Giant     4    4  4.000000  2015  2015  2015.000000    812  812  812.000000
Kings     1    3  1.666667  2014  2017  2015.666667    741  788  761.666667
Riders    1    2  1.750000  2014  2017  2015.500000    690  876  762.250000
Royals    1    4  2.500000  2014  2015  2014.500000    701  804  752.500000

In [174]:
grouped.get_group('Riders')

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

In [175]:
grouped.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [176]:
df = pd.read_csv('../data/phone_data.csv', index_col = 0)
df.head(10)

                 date  duration  item    month    network network_type
index
0      15/10/14 06:58    34.429  data  2014-11       data         data
1      15/10/14 06:58    13.000  call  2014-11   Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11     Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11      Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11      Tesco       mobile
5      15/10/14 18:55     4.000  call  2014-11      Tesco       mobile
6      16/10/14 06:58    34.429  data  2014-11       data         data
7      16/10/14 15:01   602.000  call  2014-11      Three       mobile
8      16/10/14 15:12  1050.000  call  2014-11      Three       mobile
9      16/10/14 15:30    19.000  call  2014-11  voicemail    voicemail

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          830 non-null    object
 1   duration      830 non-null    float64
 2   item          830 non-null    object
 3   month         830 non-null    object
 4   network       830 non-null    object
 5   network_type  830 non-null    object
dtypes: float64(1), object(5)
memory usage: 45.4+ KB

In [178]:
df.isnull().sum()

date            0
duration        0
item            0
month           0
network         0
network_type    0
dtype: int64

In [179]:
df['date'] = pd.to_datetime(df['date'])

In [180]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          830 non-null    datetime64[ns]
 1   duration      830 non-null    float64
 2   item          830 non-null    object
 3   month         830 non-null    object
 4   network       830 non-null    object
 5   network_type  830 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 45.4+ KB

In [181]:
# 월별 통신 이용시간의 합을 계산하시오

df.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [182]:
# 월별 통화 시간의 합

df[df['item'] == 'call'].groupby('month')['duration'].sum()

month
2014-11    25547.0
2014-12    13561.0
2015-01    17070.0
2015-02    14416.0
2015-03    21727.0
Name: duration, dtype: float64

In [183]:
# 아이템별 이용시간 합

df.groupby('item')['duration'].sum()

item
call    92321.00
data     5164.35
sms       292.00
Name: duration, dtype: float64

In [184]:
# 월별 아이템별 이용 건수

df.groupby(['month', 'item']).size().unstack()

item     call  data  sms
month
2014-11   107    29   94
2014-12    79    30   48
2015-01    88    31   86
2015-02    67    31   39
2015-03    47    29   25

In [185]:
d = {'a' : [10,20,30], 'b' : [20,30,40], 'c' : [50,60,70]}
d

{'a': [10, 20, 30], 'b': [20, 30, 40], 'c': [50, 60, 70]}

In [186]:
df = pd.DataFrame(d)
df

    a   b   c
0  10  20  50
1  20  30  60
2  30  40  70

In [187]:
df.sum()

a     60
b     90
c    180
dtype: int64

In [188]:
df.apply(sum)

a     60
b     90
c    180
dtype: int64

In [189]:
def temp(x):
    return x * 2 + 5
df.apply(temp)

    a   b    c
0  25  45  105
1  45  65  125
2  65  85  145

In [190]:
def wow(x):
    return x / 2 + 3

df[['a', 'b']].apply(wow)

      a     b
0   8.0  13.0
1  13.0  18.0
2  18.0  23.0

In [191]:
df['a'].apply(lambda x : x + 100)

0    110
1    120
2    130
Name: a, dtype: int64

In [193]:
df = pd.read_csv('../data/phone_data.csv', index_col = 0)
df.head(5)

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [198]:
# 연도만 뽑기

df['year'] = df['month'].apply(lambda x : x.split('-')[0])
df.head()

                 date  duration  item    month   network network_type  year
index
0      15/10/14 06:58    34.429  data  2014-11      data         data  2014
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile  2014
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile  2014
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile  2014
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile  2014

In [199]:
df = pd.read_csv('../data/Ecommerce Purchases')
df.head(3)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95

In [200]:
# 고객의 email에서 email domain이 각각 몇 개씩 있는지 계산하시오
# 1. 이메일에서 도메인만 추출
# 2. 각각의 도메인이 몇 개씩 있는지

In [204]:
# 1.

domain = df['Email'].apply(lambda x : x.split('@')[1])
domain

0                  yahoo.com
1                   reed.com
2       morales-harrison.com
3        olson-robinson.info
4                  gmail.com
                ...
9995         wade-garner.com
9996             hotmail.com
9997               gmail.com
9998                reid.net
9999              vaughn.com
Name: Email, Length: 10000, dtype: object

In [211]:
# 2.

domain.value_counts()

hotmail.com            1638
yahoo.com              1616
gmail.com              1605
smith.com                42
williams.com             37
                       ...
booker.com                1
woods-allen.biz           1
richards-wilson.com       1
morris-thomas.com         1
wade-garner.com           1
Name: Email, Length: 3416, dtype: int64

In [212]:
# 1. 오전 구매건수와 오후 구매 건수를 계산하시오
# 2. (value_counts()를 사용하는 경우와 사용하지 않는 경우 각각 구하시오)

In [215]:
# 1. 

df.groupby('AM or PM').size()

AM or PM
AM    4932
PM    5068
dtype: int64

In [216]:
# 2.

df['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [219]:
# 고객들이 사용하는 브라우저 종류별 갯수를 출력하시오

browser = df['Browser Info'].apply(lambda x : x.split('/')[0])
browser

0         Opera
1         Opera
2       Mozilla
3       Mozilla
4         Opera
         ...
9995    Mozilla
9996    Mozilla
9997    Mozilla
9998    Mozilla
9999    Mozilla
Name: Browser Info, Length: 10000, dtype: object

In [222]:
df.groupby(browser).size()

Browser Info
Mozilla    7924
Opera      2076
dtype: int64